playwright-artillery.yml
config:
  target: https://bootcampchat-fe.run.goorm.site

  phases:
  - duration: 2
    arrivalRate: 2

  engines:
    playwright:
      extednedMetrics: false
      launchOptions:
        headless: false
    
  processor: "./stresstest/app.js"

scenarios:
  - engine: playwright
    flowFunction: "test"