playwright-artillery.yml
config:
  target: https://ktb-chat.goorm.io

  phases:
  - duration: 2
    arrivalRate: 2

  engines:
    playwright:
      extednedMetrics: false
      launchOptions:
        headless: true
    
  processor: "./stresstest/app.js"

scenarios:
  - engine: playwright
    flowFunction: "uploadFileToChat"