playwright-artillery.yml
config:
  target: http://localhost:3000 

  phases:
    - duration: 1
      arrivalRate: 1

  engines:
    playwright:
      launchOptions:
        headless: false # FIXME: Update with your launch options

  processor: "./stresstest/app.js"

  variables:
    baseUrl: "{{ target }}"

scenarios:
  - engine: playwright
    flowFunction: wrapperFunctionChat